УчетВУправляющихДляГит1/src/Documents/УПЖКХ_ДоговорБезвозмездногоПользованияПоМестуЖительства/УПЖКХ_ДоговорБезвозмездногоПользованияПоМестуЖительства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УПЖКХ_ДоговорБезвозмездногоПользованияПоМестуЖительства</name>
  <basedOn>Document.КВП_ЗаявлениеОРегистрацииОСнятииСРегистрационногоУчетаПоМестуЖительства</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛицевойСчет</name>
    <type>
      <types>CatalogRef.КВП_ЛицевыеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Проживающий</name>
    <type>
      <types>CatalogRef.УПЖКХ_Жильцы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.КВП_ЗаявлениеОРегистрацииОСнятииСРегистрационногоУчетаПоМестуЖительства</types>
    </type>
  </attributes>
</mdclass:Document>

УчетВУправляющихДляГит1/src/Enums/КВП_ВидыОперацийРегистрацииПоМестуЖительства/КВП_ВидыОперацийРегистрацииПоМестуЖительства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КВП_ВидыОперацийРегистрацииПоМестуЖительства</name>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>СнятиеСРегистрации</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Documents/УПЖКХ_ДоговорБезвозмездногоПользованияПоМестуЖительства/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытийДокумента

// Процедура заполнения на основании
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УПЖКХ_ТиповыеМетодыСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КВП_ЗаявлениеОРегистрацииОСнятииСРегистрационногоУчетаПоМестуЖительства") Тогда
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Если ДанныеЗаполнения.ВидОперации = Перечисления.КВП_ВидыОперацийРегистрацииПоМестуЖительства.Регистрация Тогда
			// Заполнение шапки
			Комментарий = ДанныеЗаполнения.Комментарий;
			ЛицевойСчет = ДанныеЗаполнения.ЛицевойСчет;
			Организация = ДанныеЗаполнения.Организация;
			//Ответственный = ДанныеЗаполнения.Ответственный;
			Проживающий = ДанныеЗаполнения.Проживающий;
		Иначе
			УПЖКХ_ТиповыеМетодыКлиентСервер.СообщитьПользователю("В случае снятия с регистрации договор не заполняется!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "ОбработкаПроверкиЗаполнения" документа.
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("Организация");
	ПроверяемыеРеквизиты.Добавить("Проживающий");
	ПроверяемыеРеквизиты.Добавить("ЛицевойСчет");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
